/*
 * Start the puzzle 
 */
function startPuzzle(){
	var puzzle = {};
	puzzle.words = 
	[ 
					{
						"word": ["りんご"],
						"color": "#ff0000"
					},
					{
						"word": ["おとこのこ"],
						"color": "#800000"
					},
					{
						"word": ["ねこ"],
						"color": "#ffff00"
					},
					{
						"word": "いぬ",
						"color": "#ffa500"
					},
					{
						"word": "たまご",
						"color": "#00ffff"
					},
					{
						"word": "くだもの",
						"color": "#0000ff"
					},
					{
						"word": "おんなのこ",
						"color": "#ff00ff"
					},
					{
						"word": "いえ",
						"color": "#ff0000"
					},
					{
						"word": "こおり",
						"color": "#800080"
					},
					{
						"word": "みつりん",
						"color": "#00ff00"
					}
	];

	puzzle.grid = 
		[
			'ん', '+', '+', '+', '+', '+', '+', 'く', '+', '+',  
			'+', 'り', '+', 'え', 'い', '+', '+', 'だ', '+', '+',  
			'+', '+', 'つ', '+', '+', 'ぬ', '+', 'も', '+', '+',  
			'+', '+', '+', 'み', '+', '+', '+', 'の', '+', '+',  
			'+', 'こ', 'り', 'ん', 'ご', '+', '+', '+', '+', '+',  
			'+', 'の', '+', 'お', '+', '+', '+', 'お', '+', '+',  
			'+', 'こ', '+', '+', 'こ', '+', 'ん', '+', '+', '+',  
			'ね', 'と', '+', '+', '+', 'な', '+', 'た', '+', '+',  
			'+', 'お', '+', '+', 'の', '+', '+', '+', 'ま', '+',  
			'+', '+', '+', 'こ', '+', '+', '+', '+', '+', 'ご'  
		];

	puzzle.size = 10;
	puzzle.cellSize = 30;
	puzzle.length = 350;
	return puzzle;
}


