/*
 * Start the puzzle 
 */
function startPuzzle(){
	var puzzle = {};
	puzzle.words = 
	[ 
					{
						"word": ["りんご"],
						"color": "#ff0000"
					},
					{
						"word": ["おとこのこ"],
						"color": "#800000"
					},
					{
						"word": ["ねこ"],
						"color": "#ffff00"
					},
					{
						"word": "dog",
						"color": "#ffa500"
					},
					{
						"word": "egg",
						"color": "#00ffff"
					},
					{
						"word": "fruit",
						"color": "#0000ff"
					},
					{
						"word": "girl",
						"color": "#ff00ff"
					},
					{
						"word": "home",
						"color": "#ff0000"
					},
					{
						"word": "ice",
						"color": "#800080"
					},
					{
						"word": "jungle",
						"color": "#00ff00"
					}
	];

	puzzle.grid = 
		[
			'+', '+', '+', '+', '+', '+', '+', '+', '+', '+',  
			'+', '+', '+', '+', '+', '+', '+', '+', '+', '+',  
			'+', '+', '+', '+', '+', '+', '+', '+', '+', '+',  
			'+', '+', '+', '+', '+', '+', '+', '+', '+', '+',  
			'+', 'こ', 'り', 'ん', 'ご', '+', '+', '+', '+', '+',  
			'+', 'の', '+', '+', '+', '+', '+', '+', '+', '+',  
			'+', 'こ', '+', '+', '+', '+', '+', '+', '+', '+',  
			'+', 'と', '+', '+', '+', '+', '+', '+', '+', '+',  
			'+', 'お', '+', '+', '+', '+', '+', '+', '+', '+',  
			'+', '+', '+', '+', '+', '+', '+', '+', '+', '+'  
		];

	puzzle.size = 10;
	puzzle.cellSize = 30;
	puzzle.length = 350;
	return puzzle;
}


